vedro_5L = 0
vedro_3L = 0
hod = 0

var = {
    "vedro5L+": "\nНаполняем 5-ти литровое ведро до отказа!",
    "vedro3L+": "\nНаполняем 3-х литровое ведро до отказа!",
    "vedro5L-": "\nВыливаем всю воду из 5-ти литровго ведра!",
    "vedro3L-": "\nВыливаем всю воду из 3-х литровго ведра!",
    "vedro3L+5L": "\nВыливаем содержимое 3-х литрового ведра в 5-ти литровое ведро!",
    "vedro5L+3L": "\nВыливаем содержимое 5-ти литровго ведра в 3-х лтровое ведро!"
}


print("""
               Доброго времени суток!!!
            Вас приветствует загадка от самого Стива Джобса
            Разгадайте её за минимальное количество шагов
            и вам за это НИЧЕГО НЕ БУДЕТ!!!
                                            Удачи...
    """)
print("\nВот, держите два ведра.\n5-ти литровое ведро:", vedro_5L, "\nи\n3-х литровое ведро: ", vedro_3L)
print("""         
            Список доступных команд:
            vedro5L+ > Наполняем 5-ти литровое ведро до отказа!
            vedro3L+ > Наполняем 3-х литровое ведро до отказа!
            vedro5L- > Выливаем всю воду из 5-ти литровго ведра!
            vedro3L- > Выливаем всю воду из 3-х литровго ведра!
            vedro3L+5L > Выливаем содержимое 3-х литрового ведра в 5-ти литровое ведро!
            vedro5L+3L > Выливаем содержимое 5-ти литровго ведра в 3-х лтровое ведро!
""")

while vedro_5L != 4:
    itog = f"\nИТОГО ==> 5-ти литровое ведро: {vedro_5L} |  3-х литровое ведро: {vedro_3L}\n"
    itog5 = f"Теперь в вашем 5-ти литровом ведре {vedro_5L}л. воды!"
    itog3 = f"Теперь в вашем 3-х литровом ведре {vedro_3L}л. воды!"

    a = input("\nВведите желаемое действие: ")

    if a == "vedro5L+":
        hod += 1
        vedro_5L += 5

        print(var["vedro5L+"], f"\n{itog5}\n{itog}")

    elif a == "vedro3L+":
        hod += 1
        vedro_3L += 3
        print(var["vedro3L+"], f"\n{itog3}\n{itog}")

    elif a == "vedro5L-":
        hod += 1
        if vedro_5L == 0:
            print("""
            Ваше ведро и так пустое!
            Попробуйте другую комманду!
            """)
            continue

        vedro_5L -= 5
        print(var["vedro5L-"], f"\n{itog5}\n{itog}")


    elif a == "vedro3L-":
        hod += 1
        if vedro_3L == 0:
            print("""
            Ваше ведро и так пустое!
            Попробуйте другую комманду!
            """)
            continue
        vedro_3L -= 3
        print(var["vedro3L-"], f"\n{itog3}\n{itog}")

    elif a == "vedro3L+5L":
        hod += 1
        vedro_5L += 3
        vedro_3L -= 3
        print(var["vedro3L+5L"], itog)

    elif a == "vedro5L+3L":
        hod += 1
        b = vedro_5L + vedro_3L
        print(var["vedro5L+3L"], itog)

print("Введена неправильная комманда!\nВнимательноее читайте Список комманд!!!")